miner.version_info = {
    guid: null,
    version: '1.0.6.5',
    lastVersion: null,
    updater: 'http://security.baidu.com/product/findDetail.do?id=90&tabId=216',
    newLine: '\r\n',
    revision: 'revision: 1.0.0.1' + '\r\n' + 'date: 2013-9-14' + '\r\n' + 'describe: beta版本' + '\r\n' + '\r\n'
            + 'revision: 1.0.1.1' + '\r\n' + 'date: 2013-9-23' + '\r\n' + 'describe: 内测版本' + '\r\n' + '1 任务按域名归并管理' + '\r\n' + '2 增加漏洞详细报告查看功能' + '\r\n' + '3 单条任务删除功能' + '\r\n' + '4 增加界面元素信息提示' + '\r\n' + '5 增加功能配置和任务配置页面' + '\r\n' + '6 配置项实时持久化存储、实时动态更新生效' + '\r\n' + '7 完成前台popup页面和配置页面样式' + '\r\n' + '8 增加网络连通性测试' + '\r\n' + '9 版本更新信息提示' + '\r\n' + '10 增加插件唯一识别码' + '\r\n' + '11 增加线上线下切换功能' + '\r\n' + '\r\n'
            + 'revision: 1.0.1.2' + '\r\n' + 'date: 2013-9-23' + '\r\n' + 'describe: 内测版本' + '\r\n' + '1 实现url新鲜度功能' + '\r\n' + '2 增加欢迎页面' + '\r\n' + '3 欢迎页面与任务页面动态切换' + '\r\n' + '4 option页面中增加版本信息面板' + '\r\n' + '\r\n'
            + 'revision: 1.0.1.3' + '\r\n' + 'date: 2013-9-24' + '\r\n' + 'describe: 内测版本' + '\r\n' + '1 增加"消息中心"功能' + '\r\n' + '2 增加版本动态检测功能，气泡提示和页脚提示更新。' + '\r\n' + '3 欢迎页面与任务页面动态切换' + '\r\n' + '4 修复气泡按钮事件重复触发的问题' + '\r\n' + '\r\n'
            + 'revision: 1.0.1.4' + '\r\n' + 'date: 2013-9-24' + '\r\n' + 'describe: 内测版本' + '\r\n' + '1 option页面增加hint帮助提示' + '\r\n' + '2 启动时，增加网络连接性等自检功能。' + '\r\n' + '3 访问消息中心增加随机数，以绕过ajax缓存。' + '\r\n' + '4 调整消息提示已阅逻辑，引入消息id，绕开eval方式。' + '\r\n' + '\r\n'
            + 'revision: 1.0.2.1' + '\r\n' + 'date: 2013-9-25' + '\r\n' + 'describe: 内测版本' + '\r\n' + '1 增加录制模式(默认带cookie)' + '\r\n' + '2 增加播放功能(配合录制模式）' + '\r\n' + '3 增加自动抓取cookie功能，并提供选项控制。' + '\r\n' + '4 增加自动抓取referer功能，扫描时自动携带。' + '5 增加最大任务数量控制，达到数量上限时进行提示。' + '\r\n'  + '6 调整黑白名单逻辑' + '\r\n'  + '4 增加自动抓取referer功能，扫描时自动携带。' + '\r\n'  + '7 不抓取图片资源包' + '\r\n'  + '8 录制模式抓取的相同url去重' + '\r\n' + '\r\n'
            + 'revision: 1.0.3.1' + '\r\n' + 'date: 2013-9-27' + '\r\n' + 'describe: 内测版本' + '\r\n' + '1 调整内置白名单' + '\r\n' + '2 修复带cookie扫描失败的问题' + '\r\n' + '3 调整UI' + '\r\n' + '4 调整模式切换功能的用户引导。' + '\r\n' + '\r\n'
            + 'revision: 1.0.3.2' + '\r\n' + 'date: 2013-9-27' + '\r\n' + 'describe: 内测版本' + '\r\n' + '1 调整启动按钮UI' + '\r\n' + '\r\n'
            + 'revision: 1.0.4.1' + '\r\n' + 'date: 2013-10-8' + '\r\n' + 'describe: 发行版本' + '\r\n' + '1 增加任务按域名和状态来筛选、分类和数量统计的功能'  + '\r\n' + '2 调整exclude列表' + '\r\n' + '3 调整录制功能的UI交互' + '4 调整UI(删除domainTab时禁止展开)' + '\r\n' + '\r\n'
            + 'revision: 1.0.5.1' + '\r\n' + 'date: 2013-10-18' + '\r\n' + 'describe: 发行版本' + '\r\n' + '1 任务达到最大上限通知窗口中增加清除功能' + '\r\n' + '2 增加自动清理任务的功能（默认不开启）' + '\r\n' + '3 清除按钮自动显示' + '\r\n' + '4 增加url按模式去重功能' + '\r\n' + '5 增加识别并过滤自动化Ajax的功能' + '\r\n' + '6 过滤掉纯路径url' + '\r\n' + '7 过滤掉资源文件' + '\r\n' + '8 解决webserver类漏洞重复提示的问题' + '\r\n' + '9 解决回调函数造成的垃圾数据的问题' + '\r\n' + '10 其他一些功能优化和调整' + '\r\n' + '\r\n'
            + 'revision: 1.0.5.2' + '\r\n' + 'date: 2013-10-21' + '\r\n' + 'describe: 发行版本' + '\r\n' + '1 识别并过滤自动化jsonp调用' + '\r\n' + '\r\n'
            + 'revision: 1.0.6.1' + '\r\n' + 'date: 2013-10-21' + '\r\n' + 'describe: 发行版本' + '\r\n' + '1 识别并过滤页面自刷新、Ajax、Jsonp、WebSocket等代码自动化产生的重复流量' + '\r\n' + '2 开放内网ip任务(10段、172段)'+ '\r\n' + '\r\n'
            + 'revision: 1.0.6.3' + '\r\n' + 'date: 2013-10-22' + '\r\n' + 'describe: 发行版本' + '\r\n' + '1 调整冒泡通知的策略' + '\r\n' + '2 加入清理冒泡通知历史缓存的功能' + '\r\n' + '3 修正缓存的历史消息被同时触发的问题（如更新时打开多个tab）'+ '\r\n' + '4 用户填写邮箱后，扫出漏洞将自动发送邮件通知' + '\r\n' + '5 增加查询间距' + '\r\n'+ '\r\n'
            + 'revision: 1.0.6.5' + '\r\n' + 'date: 2013-10-22' + '\r\n' + 'describe: 发行版本' + '\r\n' + '1 调整url新鲜度默认值' + '\r\n' + '2 用户手动触发的流量不受url新鲜度限制' + '\r\n'+ '\r\n'
            
};
